/**
 * M1 SGS Student to Room & Seat Number Mapping
 * Generated from authentic SGS grade 1 roster file.
 */
export interface M1SgsLookupEntry {
  code: string;
  seatNo: number;
  name: string;
  room: string;
}

export const M1_SGS_STUDENT_LOOKUP: Record<string, M1SgsLookupEntry> = {
  "15833": {
    "code": "15833",
    "seatNo": 1,
    "name": "เด็กชายอัคครา  โคตรโสภา",
    "room": "ม.1/5"
  },
  "16056": {
    "code": "16056",
    "seatNo": 1,
    "name": "เด็กชายจิรพัฒน์  ภูฆัง",
    "room": "ม.1/1"
  },
  "16057": {
    "code": "16057",
    "seatNo": 2,
    "name": "เด็กชายชยุติ  พลทอง",
    "room": "ม.1/1"
  },
  "16058": {
    "code": "16058",
    "seatNo": 3,
    "name": "เด็กชายณัฐพล  เนตรสว่าง",
    "room": "ม.1/1"
  },
  "16059": {
    "code": "16059",
    "seatNo": 4,
    "name": "เด็กชายธนัชชญาน์  ธงยศ",
    "room": "ม.1/1"
  },
  "16060": {
    "code": "16060",
    "seatNo": 5,
    "name": "เด็กชายธิติพันธุ์  ชัยบุรม",
    "room": "ม.1/1"
  },
  "16061": {
    "code": "16061",
    "seatNo": 6,
    "name": "เด็กชายธีรดล  สาขำ",
    "room": "ม.1/1"
  },
  "16062": {
    "code": "16062",
    "seatNo": 7,
    "name": "เด็กชายภานุวัตน์  ไชยสันต์",
    "room": "ม.1/1"
  },
  "16063": {
    "code": "16063",
    "seatNo": 8,
    "name": "เด็กชายภูตะวัน  ฮุยเสนา",
    "room": "ม.1/1"
  },
  "16064": {
    "code": "16064",
    "seatNo": 9,
    "name": "เด็กชายรัตนชาติ  ชาติบุตร",
    "room": "ม.1/1"
  },
  "16065": {
    "code": "16065",
    "seatNo": 10,
    "name": "เด็กชายศุภชัย  รถดี",
    "room": "ม.1/1"
  },
  "16066": {
    "code": "16066",
    "seatNo": 11,
    "name": "เด็กชายศุภณัฐ  อรชัย",
    "room": "ม.1/1"
  },
  "16067": {
    "code": "16067",
    "seatNo": 12,
    "name": "เด็กชายอชิระ  บุญวิจิตร",
    "room": "ม.1/1"
  },
  "16068": {
    "code": "16068",
    "seatNo": 13,
    "name": "เด็กหญิงกัญจนาภร  กุดแถลง",
    "room": "ม.1/1"
  },
  "16069": {
    "code": "16069",
    "seatNo": 14,
    "name": "เด็กหญิงจิดาภา  ถูปาอ่าง",
    "room": "ม.1/1"
  },
  "16070": {
    "code": "16070",
    "seatNo": 15,
    "name": "เด็กหญิงชญาดา  บุญหนา",
    "room": "ม.1/1"
  },
  "16071": {
    "code": "16071",
    "seatNo": 16,
    "name": "เด็กหญิงชฎาภรณ์  พงษ์นิมิตร",
    "room": "ม.1/1"
  },
  "16072": {
    "code": "16072",
    "seatNo": 17,
    "name": "เด็กหญิงชลธิชา  ชัยฤทธิ์",
    "room": "ม.1/1"
  },
  "16073": {
    "code": "16073",
    "seatNo": 18,
    "name": "เด็กหญิงณัชชา  จันทร์ไพสน",
    "room": "ม.1/1"
  },
  "16074": {
    "code": "16074",
    "seatNo": 19,
    "name": "เด็กหญิงณัชชา  พลพราหมณ์",
    "room": "ม.1/1"
  },
  "16075": {
    "code": "16075",
    "seatNo": 20,
    "name": "เด็กหญิงณัฐณิชา  แก้วหลวง",
    "room": "ม.1/1"
  },
  "16076": {
    "code": "16076",
    "seatNo": 21,
    "name": "เด็กหญิงฑิตฐิตา  ยอดคีรี",
    "room": "ม.1/1"
  },
  "16077": {
    "code": "16077",
    "seatNo": 22,
    "name": "เด็กหญิงนันธิดา  วงษ์ละคร",
    "room": "ม.1/1"
  },
  "16078": {
    "code": "16078",
    "seatNo": 23,
    "name": "เด็กหญิงปนัสยา  กุลไชย",
    "room": "ม.1/1"
  },
  "16079": {
    "code": "16079",
    "seatNo": 24,
    "name": "เด็กหญิงปาณิสรา  จันทร์แก้ว",
    "room": "ม.1/1"
  },
  "16080": {
    "code": "16080",
    "seatNo": 25,
    "name": "เด็กหญิงพรประภา  บัวแก้ว",
    "room": "ม.1/1"
  },
  "16081": {
    "code": "16081",
    "seatNo": 26,
    "name": "เด็กหญิงพัชรพรรณ  วรรณศรี",
    "room": "ม.1/1"
  },
  "16082": {
    "code": "16082",
    "seatNo": 27,
    "name": "เด็กหญิงพัชราดา  หวันธรรมมา",
    "room": "ม.1/1"
  },
  "16083": {
    "code": "16083",
    "seatNo": 28,
    "name": "เด็กหญิงรัชนีกร  พลคำมาก",
    "room": "ม.1/1"
  },
  "16084": {
    "code": "16084",
    "seatNo": 29,
    "name": "เด็กหญิงรินรดา  วิลัยพิศ",
    "room": "ม.1/1"
  },
  "16085": {
    "code": "16085",
    "seatNo": 30,
    "name": "เด็กหญิงลักษิกา  หาญชนะ",
    "room": "ม.1/1"
  },
  "16086": {
    "code": "16086",
    "seatNo": 31,
    "name": "เด็กหญิงวรรณิษา  ชัยบุรม",
    "room": "ม.1/1"
  },
  "16087": {
    "code": "16087",
    "seatNo": 32,
    "name": "เด็กหญิงวรัทยา  ทองบุตร",
    "room": "ม.1/1"
  },
  "16088": {
    "code": "16088",
    "seatNo": 33,
    "name": "เด็กหญิงวิชญาดา  ธรรมวงษ์",
    "room": "ม.1/1"
  },
  "16089": {
    "code": "16089",
    "seatNo": 34,
    "name": "เด็กหญิงวิไลลักษณ์  กลิ่นนาค",
    "room": "ม.1/1"
  },
  "16090": {
    "code": "16090",
    "seatNo": 35,
    "name": "เด็กหญิงอริศรา  ศรีวงษ์",
    "room": "ม.1/1"
  },
  "16091": {
    "code": "16091",
    "seatNo": 1,
    "name": "เด็กชายกฤษณพล  ตุลาพิพากษ์",
    "room": "ม.1/2"
  },
  "16092": {
    "code": "16092",
    "seatNo": 2,
    "name": "เด็กชายจักรพันธ์  สังสะดี",
    "room": "ม.1/2"
  },
  "16093": {
    "code": "16093",
    "seatNo": 3,
    "name": "เด็กชายชัยมงคล  โพธิ์ศรี",
    "room": "ม.1/2"
  },
  "16094": {
    "code": "16094",
    "seatNo": 4,
    "name": "เด็กชายณัฐภัทร  พิลาลัย",
    "room": "ม.1/2"
  },
  "16095": {
    "code": "16095",
    "seatNo": 5,
    "name": "เด็กชายทรงพล  คำกันหา",
    "room": "ม.1/2"
  },
  "16096": {
    "code": "16096",
    "seatNo": 6,
    "name": "เด็กชายทักษ์ดนัย  อรรคสังข์",
    "room": "ม.1/2"
  },
  "16097": {
    "code": "16097",
    "seatNo": 7,
    "name": "เด็กชายธีรภัทร  วงค์หาจักร์",
    "room": "ม.1/2"
  },
  "16098": {
    "code": "16098",
    "seatNo": 8,
    "name": "เด็กชายปทิต  เลิศล้ำ",
    "room": "ม.1/2"
  },
  "16099": {
    "code": "16099",
    "seatNo": 9,
    "name": "เด็กชายพีรณัฐ  ตั้งศรีสำเริง",
    "room": "ม.1/2"
  },
  "16100": {
    "code": "16100",
    "seatNo": 10,
    "name": "เด็กชายภัทรพล  เชษฐาชัย",
    "room": "ม.1/2"
  },
  "16101": {
    "code": "16101",
    "seatNo": 11,
    "name": "เด็กชายฤชุวิญญ์  เพชรชารี",
    "room": "ม.1/2"
  },
  "16102": {
    "code": "16102",
    "seatNo": 12,
    "name": "เด็กชายวรภพ  บรรพต",
    "room": "ม.1/2"
  },
  "16103": {
    "code": "16103",
    "seatNo": 13,
    "name": "เด็กชายวิชญพงศ์  บุญยืน",
    "room": "ม.1/2"
  },
  "16104": {
    "code": "16104",
    "seatNo": 14,
    "name": "เด็กชายศุภฤกษ์  แสงสุวรรณ์",
    "room": "ม.1/2"
  },
  "16105": {
    "code": "16105",
    "seatNo": 15,
    "name": "เด็กชายอาวาริทธิ์  โคสมบูรณ์",
    "room": "ม.1/2"
  },
  "16106": {
    "code": "16106",
    "seatNo": 17,
    "name": "เด็กหญิงทฤษนากร  ทะวะลัย",
    "room": "ม.1/2"
  },
  "16107": {
    "code": "16107",
    "seatNo": 18,
    "name": "เด็กหญิงเกวรินทร์  ทูคำมี",
    "room": "ม.1/2"
  },
  "16108": {
    "code": "16108",
    "seatNo": 19,
    "name": "เด็กหญิงโชติกา  ชัยนา",
    "room": "ม.1/2"
  },
  "16109": {
    "code": "16109",
    "seatNo": 20,
    "name": "เด็กหญิงณัฐธิญาณ์  มีสม",
    "room": "ม.1/2"
  },
  "16110": {
    "code": "16110",
    "seatNo": 21,
    "name": "เด็กหญิงธัญญารัตน์  สีชาติ",
    "room": "ม.1/2"
  },
  "16111": {
    "code": "16111",
    "seatNo": 22,
    "name": "เด็กหญิงธีรนัฐ  ตันรัตน์",
    "room": "ม.1/2"
  },
  "16112": {
    "code": "16112",
    "seatNo": 23,
    "name": "เด็กหญิงปภาวดี  ศิริชนม์",
    "room": "ม.1/2"
  },
  "16113": {
    "code": "16113",
    "seatNo": 24,
    "name": "เด็กหญิงปิยธิดา  เถาถาวงศ์",
    "room": "ม.1/2"
  },
  "16114": {
    "code": "16114",
    "seatNo": 25,
    "name": "เด็กหญิงพิชญา  ปัญญาทอง",
    "room": "ม.1/2"
  },
  "16115": {
    "code": "16115",
    "seatNo": 26,
    "name": "เด็กหญิงพิมพกานต์  แก้วหาวงค์",
    "room": "ม.1/2"
  },
  "16116": {
    "code": "16116",
    "seatNo": 27,
    "name": "เด็กหญิงภัทรวดี  สุขขา",
    "room": "ม.1/2"
  },
  "16117": {
    "code": "16117",
    "seatNo": 28,
    "name": "เด็กหญิงวรัญญา  เคเมือง",
    "room": "ม.1/2"
  },
  "16118": {
    "code": "16118",
    "seatNo": 29,
    "name": "เด็กหญิงวารุณี  อุ่นวิเศษ",
    "room": "ม.1/2"
  },
  "16119": {
    "code": "16119",
    "seatNo": 30,
    "name": "เด็กหญิงศิรินทิพย์  ทองบุตรบุญนาม",
    "room": "ม.1/2"
  },
  "16120": {
    "code": "16120",
    "seatNo": 31,
    "name": "เด็กหญิงสิรินพร  ศักดี",
    "room": "ม.1/2"
  },
  "16121": {
    "code": "16121",
    "seatNo": 32,
    "name": "เด็กหญิงอภิชญานันท์  ไชยา",
    "room": "ม.1/2"
  },
  "16122": {
    "code": "16122",
    "seatNo": 33,
    "name": "เด็กหญิงอุรัสยา  วงษ์ยา",
    "room": "ม.1/2"
  },
  "16123": {
    "code": "16123",
    "seatNo": 1,
    "name": "เด็กชายทินภัทร  คะดุลย์",
    "room": "ม.1/3"
  },
  "16124": {
    "code": "16124",
    "seatNo": 2,
    "name": "เด็กชายธนพัฒน์  ราชแทน",
    "room": "ม.1/3"
  },
  "16125": {
    "code": "16125",
    "seatNo": 3,
    "name": "เด็กชายธราเทพ  วงค์โพย",
    "room": "ม.1/3"
  },
  "16126": {
    "code": "16126",
    "seatNo": 4,
    "name": "เด็กชายนพกร  ใจจำรัสกุล",
    "room": "ม.1/3"
  },
  "16127": {
    "code": "16127",
    "seatNo": 5,
    "name": "เด็กชายพงศ์พล  อุตระสัย",
    "room": "ม.1/3"
  },
  "16128": {
    "code": "16128",
    "seatNo": 6,
    "name": "เด็กชายภูปกรณ์  ศรศิลป์",
    "room": "ม.1/3"
  },
  "16129": {
    "code": "16129",
    "seatNo": 7,
    "name": "เด็กชายยสินทร  ศรีกุล",
    "room": "ม.1/3"
  },
  "16130": {
    "code": "16130",
    "seatNo": 8,
    "name": "เด็กชายรณพีร์  มิ่งแก้ว",
    "room": "ม.1/3"
  },
  "16131": {
    "code": "16131",
    "seatNo": 9,
    "name": "เด็กชายรัชชานนท์  กลิ่นจันทร์",
    "room": "ม.1/3"
  },
  "16132": {
    "code": "16132",
    "seatNo": 10,
    "name": "เด็กชายรัชชานนท์  ขันติกุล",
    "room": "ม.1/3"
  },
  "16133": {
    "code": "16133",
    "seatNo": 11,
    "name": "เด็กชายรัชชานนท์  ผางสุวรรณ์",
    "room": "ม.1/3"
  },
  "16134": {
    "code": "16134",
    "seatNo": 12,
    "name": "เด็กชายราเมศวร์  อินทร์แก้ว",
    "room": "ม.1/3"
  },
  "16135": {
    "code": "16135",
    "seatNo": 13,
    "name": "เด็กชายอดิเทพ  นากลาง",
    "room": "ม.1/3"
  },
  "16136": {
    "code": "16136",
    "seatNo": 14,
    "name": "เด็กชายอนาวิล  สมโคตร",
    "room": "ม.1/3"
  },
  "16137": {
    "code": "16137",
    "seatNo": 15,
    "name": "เด็กชายอนาวิล  หงษ์ทอง",
    "room": "ม.1/3"
  },
  "16138": {
    "code": "16138",
    "seatNo": 16,
    "name": "เด็กหญิงกมลชนก  ทาบุเรศ",
    "room": "ม.1/3"
  },
  "16139": {
    "code": "16139",
    "seatNo": 17,
    "name": "เด็กหญิงกิตติกา  บุตรดา",
    "room": "ม.1/3"
  },
  "16140": {
    "code": "16140",
    "seatNo": 18,
    "name": "เด็กหญิงณัฐชา  จีกระโทก",
    "room": "ม.1/3"
  },
  "16141": {
    "code": "16141",
    "seatNo": 19,
    "name": "เด็กหญิงณัฐชา  ปัญญาวงค์",
    "room": "ม.1/3"
  },
  "16142": {
    "code": "16142",
    "seatNo": 20,
    "name": "เด็กหญิงธนาภา  ทองหล่อ",
    "room": "ม.1/3"
  },
  "16143": {
    "code": "16143",
    "seatNo": 21,
    "name": "เด็กหญิงนิภาดา  พะกะนวน",
    "room": "ม.1/3"
  },
  "16144": {
    "code": "16144",
    "seatNo": 22,
    "name": "เด็กหญิงปริมนภา  จันทวงค์",
    "room": "ม.1/3"
  },
  "16145": {
    "code": "16145",
    "seatNo": 23,
    "name": "เด็กหญิงปัณฑิตา  ต้นคำฮัก",
    "room": "ม.1/3"
  },
  "16146": {
    "code": "16146",
    "seatNo": 24,
    "name": "เด็กหญิงปัณณพร  บุญมาลา",
    "room": "ม.1/3"
  },
  "16147": {
    "code": "16147",
    "seatNo": 25,
    "name": "เด็กหญิงวาลิดา  ดวงแจ่ม",
    "room": "ม.1/3"
  },
  "16148": {
    "code": "16148",
    "seatNo": 26,
    "name": "เด็กหญิงวิภาดา  ธรรมวงษา",
    "room": "ม.1/3"
  },
  "16149": {
    "code": "16149",
    "seatNo": 27,
    "name": "เด็กหญิงศิโรรัตน์  ผิวดี",
    "room": "ม.1/3"
  },
  "16150": {
    "code": "16150",
    "seatNo": 28,
    "name": "เด็กหญิงสุนันทา  ปะระทัง",
    "room": "ม.1/3"
  },
  "16151": {
    "code": "16151",
    "seatNo": 29,
    "name": "เด็กหญิงสุนิษา  นวลไสย",
    "room": "ม.1/3"
  },
  "16152": {
    "code": "16152",
    "seatNo": 30,
    "name": "เด็กหญิงอริสา  บุญฤทธิ์",
    "room": "ม.1/3"
  },
  "16153": {
    "code": "16153",
    "seatNo": 1,
    "name": "เด็กชายกวินวัชร์  แย้มโกสุม",
    "room": "ม.1/4"
  },
  "16154": {
    "code": "16154",
    "seatNo": 2,
    "name": "เด็กชายเกล้าแก้ว  แก้วไพ",
    "room": "ม.1/4"
  },
  "16155": {
    "code": "16155",
    "seatNo": 3,
    "name": "เด็กชายฐิติวัฒน์  พิมพ์วงค์",
    "room": "ม.1/4"
  },
  "16156": {
    "code": "16156",
    "seatNo": 4,
    "name": "เด็กชายเดชวาคิม  พิมพระ",
    "room": "ม.1/4"
  },
  "16157": {
    "code": "16157",
    "seatNo": 5,
    "name": "เด็กชายธนกิฎติ์  กระบวนสืบ",
    "room": "ม.1/4"
  },
  "16158": {
    "code": "16158",
    "seatNo": 6,
    "name": "เด็กชายธนินกร  ขันงาม",
    "room": "ม.1/4"
  },
  "16159": {
    "code": "16159",
    "seatNo": 7,
    "name": "เด็กชายพัชรพล  กาบจันทร์",
    "room": "ม.1/4"
  },
  "16160": {
    "code": "16160",
    "seatNo": 8,
    "name": "เด็กชายพีรวัส  ไชยเลิศ",
    "room": "ม.1/4"
  },
  "16161": {
    "code": "16161",
    "seatNo": 9,
    "name": "เด็กชายภานุวัฒน์  ว่องไว",
    "room": "ม.1/4"
  },
  "16162": {
    "code": "16162",
    "seatNo": 10,
    "name": "เด็กชายภูผา  ปราสาตัง",
    "room": "ม.1/4"
  },
  "16163": {
    "code": "16163",
    "seatNo": 11,
    "name": "เด็กชายวรวิทย์  แซ่ลี",
    "room": "ม.1/4"
  },
  "16164": {
    "code": "16164",
    "seatNo": 12,
    "name": "เด็กชายวีรพัฒน์  จันแดง",
    "room": "ม.1/4"
  },
  "16165": {
    "code": "16165",
    "seatNo": 13,
    "name": "เด็กชายสมพงษ์  ศรีระวรรณ",
    "room": "ม.1/4"
  },
  "16166": {
    "code": "16166",
    "seatNo": 14,
    "name": "เด็กชายสุภัทรชัย  ทองนาค",
    "room": "ม.1/4"
  },
  "16167": {
    "code": "16167",
    "seatNo": 19,
    "name": "เด็กหญิงกมลชนก  สัตโต",
    "room": "ม.1/4"
  },
  "16168": {
    "code": "16168",
    "seatNo": 20,
    "name": "เด็กหญิงจิณณ์ฑาธิป  จันทร์มาตร",
    "room": "ม.1/4"
  },
  "16169": {
    "code": "16169",
    "seatNo": 21,
    "name": "เด็กหญิงชลนิภา  บุญศิริ",
    "room": "ม.1/4"
  },
  "16170": {
    "code": "16170",
    "seatNo": 22,
    "name": "เด็กหญิงณหทัย  หาดชัยภูมิ์",
    "room": "ม.1/4"
  },
  "16171": {
    "code": "16171",
    "seatNo": 23,
    "name": "เด็กหญิงณัฐชานันท์  ม่วงพุ่ม",
    "room": "ม.1/4"
  },
  "16172": {
    "code": "16172",
    "seatNo": 24,
    "name": "เด็กหญิงทิพวรรณ  นูพลกรัง",
    "room": "ม.1/4"
  },
  "16173": {
    "code": "16173",
    "seatNo": 25,
    "name": "เด็กหญิงธัญวาลี  บุญนาม",
    "room": "ม.1/4"
  },
  "16174": {
    "code": "16174",
    "seatNo": 26,
    "name": "เด็กหญิงนฤมล  มีสุข",
    "room": "ม.1/4"
  },
  "16175": {
    "code": "16175",
    "seatNo": 27,
    "name": "เด็กหญิงนารีรัตน์  พลพันธุ์",
    "room": "ม.1/4"
  },
  "16176": {
    "code": "16176",
    "seatNo": 28,
    "name": "เด็กหญิงเนตรนภา  พลพันธุ์",
    "room": "ม.1/4"
  },
  "16177": {
    "code": "16177",
    "seatNo": 29,
    "name": "เด็กหญิงปิยะดา  ดอนธงขวา",
    "room": "ม.1/4"
  },
  "16178": {
    "code": "16178",
    "seatNo": 30,
    "name": "เด็กหญิงยิ่งลักษณ์  อินทโภคา",
    "room": "ม.1/4"
  },
  "16179": {
    "code": "16179",
    "seatNo": 31,
    "name": "เด็กหญิงวชราภรณ์  เรืองราม",
    "room": "ม.1/4"
  },
  "16180": {
    "code": "16180",
    "seatNo": 32,
    "name": "เด็กหญิงศรัณยา  วงค์หาจักร์",
    "room": "ม.1/4"
  },
  "16181": {
    "code": "16181",
    "seatNo": 33,
    "name": "เด็กหญิงศิริวรรณ  ภู่โกสีย์",
    "room": "ม.1/4"
  },
  "16182": {
    "code": "16182",
    "seatNo": 34,
    "name": "เด็กหญิงสุกัญญา  แสนวาด",
    "room": "ม.1/4"
  },
  "16183": {
    "code": "16183",
    "seatNo": 35,
    "name": "เด็กหญิงสุรารักษ์  วงษ์แพงศรี",
    "room": "ม.1/4"
  },
  "16184": {
    "code": "16184",
    "seatNo": 2,
    "name": "เด็กชายก้องภพ  คิดเหมือน",
    "room": "ม.1/5"
  },
  "16185": {
    "code": "16185",
    "seatNo": 3,
    "name": "เด็กชายคนาธิป  วังหอม",
    "room": "ม.1/5"
  },
  "16186": {
    "code": "16186",
    "seatNo": 4,
    "name": "เด็กชายจันทรัช  เนตรไพฑูรย์",
    "room": "ม.1/5"
  },
  "16187": {
    "code": "16187",
    "seatNo": 5,
    "name": "เด็กชายติณณภพ  ศรีสุพัฒน์",
    "room": "ม.1/5"
  },
  "16188": {
    "code": "16188",
    "seatNo": 6,
    "name": "เด็กชายธนวรรธน์  อุปพงษ์",
    "room": "ม.1/5"
  },
  "16189": {
    "code": "16189",
    "seatNo": 7,
    "name": "เด็กชายธรรมรัตน์  ศิริปัญญา",
    "room": "ม.1/5"
  },
  "16190": {
    "code": "16190",
    "seatNo": 8,
    "name": "เด็กชายธีรศักดิ์  จันทร์โพนงาม",
    "room": "ม.1/5"
  },
  "16191": {
    "code": "16191",
    "seatNo": 9,
    "name": "เด็กชายพีระพงษ์  พรรณรักษ์",
    "room": "ม.1/5"
  },
  "16192": {
    "code": "16192",
    "seatNo": 10,
    "name": "เด็กชายภานุพงศ์  ภูวงศ์ษา",
    "room": "ม.1/5"
  },
  "16193": {
    "code": "16193",
    "seatNo": 11,
    "name": "เด็กชายยุทธนากรณ์  โพธิสาร",
    "room": "ม.1/5"
  },
  "16194": {
    "code": "16194",
    "seatNo": 12,
    "name": "เด็กชายวงศพัทธ์  ชุมเสนา",
    "room": "ม.1/5"
  },
  "16195": {
    "code": "16195",
    "seatNo": 13,
    "name": "เด็กชายวุฒิพัฒน์  พูลศิลา",
    "room": "ม.1/5"
  },
  "16196": {
    "code": "16196",
    "seatNo": 14,
    "name": "เด็กชายสายสัมพัน  ขันคำ",
    "room": "ม.1/5"
  },
  "16197": {
    "code": "16197",
    "seatNo": 15,
    "name": "เด็กชายอดิศักดิ์  ถนอมสัตย์",
    "room": "ม.1/5"
  },
  "16198": {
    "code": "16198",
    "seatNo": 17,
    "name": "เด็กหญิงกนกรัชต์  ภูหวัง",
    "room": "ม.1/5"
  },
  "16199": {
    "code": "16199",
    "seatNo": 18,
    "name": "เด็กหญิงชุภาภรณ์  แสนหลวง",
    "room": "ม.1/5"
  },
  "16200": {
    "code": "16200",
    "seatNo": 19,
    "name": "เด็กหญิงณัฐณิชา  คำปัญญา",
    "room": "ม.1/5"
  },
  "16201": {
    "code": "16201",
    "seatNo": 20,
    "name": "เด็กหญิงณัฐริณีน์  แพงศรี",
    "room": "ม.1/5"
  },
  "16202": {
    "code": "16202",
    "seatNo": 21,
    "name": "เด็กหญิงณิชานันท์  สาสิม",
    "room": "ม.1/5"
  },
  "16203": {
    "code": "16203",
    "seatNo": 22,
    "name": "เด็กหญิงธิดาพร  ตะหน่อง",
    "room": "ม.1/5"
  },
  "16204": {
    "code": "16204",
    "seatNo": 23,
    "name": "เด็กหญิงนันท์นภัส  ผางสำเนียง",
    "room": "ม.1/5"
  },
  "16205": {
    "code": "16205",
    "seatNo": 24,
    "name": "เด็กหญิงบัณฑิตา  สังข์สุวรรณ",
    "room": "ม.1/5"
  },
  "16206": {
    "code": "16206",
    "seatNo": 25,
    "name": "เด็กหญิงประกายแก้ว  สมศรีมี",
    "room": "ม.1/5"
  },
  "16207": {
    "code": "16207",
    "seatNo": 26,
    "name": "เด็กหญิงพิมพ์ชนก  เขตจตุหรัต",
    "room": "ม.1/5"
  },
  "16208": {
    "code": "16208",
    "seatNo": 27,
    "name": "เด็กหญิงยุพาทิพย์  หันตุลา",
    "room": "ม.1/5"
  },
  "16209": {
    "code": "16209",
    "seatNo": 28,
    "name": "เด็กหญิงวรรณสา  อ่อนตา",
    "room": "ม.1/5"
  },
  "16210": {
    "code": "16210",
    "seatNo": 29,
    "name": "เด็กหญิงวราภร  สมโครต",
    "room": "ม.1/5"
  },
  "16211": {
    "code": "16211",
    "seatNo": 30,
    "name": "เด็กหญิงศุภสุตา  ศรีหานิล",
    "room": "ม.1/5"
  },
  "16212": {
    "code": "16212",
    "seatNo": 31,
    "name": "เด็กหญิงสุพรรษา  อาจจงรักษ์",
    "room": "ม.1/5"
  },
  "16213": {
    "code": "16213",
    "seatNo": 32,
    "name": "เด็กหญิงสุรีนาตร  หาญสุโพธิ์",
    "room": "ม.1/5"
  },
  "16214": {
    "code": "16214",
    "seatNo": 33,
    "name": "เด็กหญิงอภิญญา  สมัครดี",
    "room": "ม.1/5"
  },
  "16215": {
    "code": "16215",
    "seatNo": 1,
    "name": "เด็กชายกิตตินันท์  วังนุราช",
    "room": "ม.1/6"
  },
  "16216": {
    "code": "16216",
    "seatNo": 2,
    "name": "เด็กชายโฆษิตพงษ์  อรกุล",
    "room": "ม.1/6"
  },
  "16217": {
    "code": "16217",
    "seatNo": 3,
    "name": "เด็กชายจิรายุทธ  สมแก้ว",
    "room": "ม.1/6"
  },
  "16218": {
    "code": "16218",
    "seatNo": 4,
    "name": "เด็กชายณัฐชนน  วรรณไชย",
    "room": "ม.1/6"
  },
  "16219": {
    "code": "16219",
    "seatNo": 5,
    "name": "เด็กชายธนากร  เทียนหลิม",
    "room": "ม.1/6"
  },
  "16220": {
    "code": "16220",
    "seatNo": 6,
    "name": "เด็กชายธีรภัทร  ขาวกา",
    "room": "ม.1/6"
  },
  "16221": {
    "code": "16221",
    "seatNo": 7,
    "name": "เด็กชายธีระพงษ์  สีหารัตน์",
    "room": "ม.1/6"
  },
  "16222": {
    "code": "16222",
    "seatNo": 8,
    "name": "เด็กชายพัสกร  โคตรคำ",
    "room": "ม.1/6"
  },
  "16223": {
    "code": "16223",
    "seatNo": 9,
    "name": "เด็กชายภาณุวัฒน์  พัฒนะสาร",
    "room": "ม.1/6"
  },
  "16224": {
    "code": "16224",
    "seatNo": 10,
    "name": "เด็กชายรัชชานนท์  ฮามทำมา",
    "room": "ม.1/6"
  },
  "16225": {
    "code": "16225",
    "seatNo": 11,
    "name": "เด็กชายวชิรวิทย์  สุขพร้อม",
    "room": "ม.1/6"
  },
  "16226": {
    "code": "16226",
    "seatNo": 12,
    "name": "เด็กชายวันชัย  ชัยภูมิ",
    "room": "ม.1/6"
  },
  "16227": {
    "code": "16227",
    "seatNo": 13,
    "name": "เด็กชายสิทธินนท์  แก้วกาโศก",
    "room": "ม.1/6"
  },
  "16228": {
    "code": "16228",
    "seatNo": 14,
    "name": "เด็กชายอภิรัฐ  เดชประมวลพล",
    "room": "ม.1/6"
  },
  "16229": {
    "code": "16229",
    "seatNo": 18,
    "name": "เด็กหญิงกฤตชญา  จันนาวัน",
    "room": "ม.1/6"
  },
  "16230": {
    "code": "16230",
    "seatNo": 19,
    "name": "เด็กหญิงชยุตรา  หวยกระโทก",
    "room": "ม.1/6"
  },
  "16231": {
    "code": "16231",
    "seatNo": 20,
    "name": "เด็กหญิงฐาปนิต  สมจิตร",
    "room": "ม.1/6"
  },
  "16232": {
    "code": "16232",
    "seatNo": 21,
    "name": "เด็กหญิงณัฐณิชา  สุวรรณสุข",
    "room": "ม.1/6"
  },
  "16233": {
    "code": "16233",
    "seatNo": 22,
    "name": "เด็กหญิงณัฐิดา  โคตโยธา",
    "room": "ม.1/6"
  },
  "16234": {
    "code": "16234",
    "seatNo": 23,
    "name": "เด็กหญิงธนัญญา  ชุมอภัย",
    "room": "ม.1/6"
  },
  "16235": {
    "code": "16235",
    "seatNo": 24,
    "name": "เด็กหญิงบุณยวีร์  วงษ์ตรีศรี",
    "room": "ม.1/6"
  },
  "16236": {
    "code": "16236",
    "seatNo": 25,
    "name": "เด็กหญิงปัณฑิตา  ชนะมาร",
    "room": "ม.1/6"
  },
  "16237": {
    "code": "16237",
    "seatNo": 26,
    "name": "เด็กหญิงพิชชาพร  วรรตคุ",
    "room": "ม.1/6"
  },
  "16238": {
    "code": "16238",
    "seatNo": 27,
    "name": "เด็กหญิงพิชญาภา  พิมพิศาล",
    "room": "ม.1/6"
  },
  "16239": {
    "code": "16239",
    "seatNo": 28,
    "name": "เด็กหญิงยุพารัตน์  จิระโชติ",
    "room": "ม.1/6"
  },
  "16240": {
    "code": "16240",
    "seatNo": 29,
    "name": "เด็กหญิงวรัชญาน์  ไชยสิงห์",
    "room": "ม.1/6"
  },
  "16241": {
    "code": "16241",
    "seatNo": 30,
    "name": "เด็กหญิงวัชราภรณ์  ศรีภูธร",
    "room": "ม.1/6"
  },
  "16242": {
    "code": "16242",
    "seatNo": 31,
    "name": "เด็กหญิงศศิธร  แก้วสีชา",
    "room": "ม.1/6"
  },
  "16243": {
    "code": "16243",
    "seatNo": 32,
    "name": "เด็กหญิงสุพัฒตรา  ทองสีดี",
    "room": "ม.1/6"
  },
  "16244": {
    "code": "16244",
    "seatNo": 33,
    "name": "เด็กหญิงอนุรดี  ศิลาแดง",
    "room": "ม.1/6"
  },
  "16245": {
    "code": "16245",
    "seatNo": 34,
    "name": "เด็กหญิงอรัญญา  รักษานนท์",
    "room": "ม.1/6"
  },
  "16286": {
    "code": "16286",
    "seatNo": 15,
    "name": "เด็กชายกรณ์กระวี  ศรีนอก",
    "room": "ม.1/4"
  },
  "16287": {
    "code": "16287",
    "seatNo": 16,
    "name": "เด็กชายกันทรากร  ศรีเดช",
    "room": "ม.1/5"
  },
  "16288": {
    "code": "16288",
    "seatNo": 15,
    "name": "เด็กชายจตุภัทร์  โคตรศรีวงศ์",
    "room": "ม.1/6"
  },
  "16293": {
    "code": "16293",
    "seatNo": 34,
    "name": "เด็กหญิงกชพรรณ  บรรพโคตร",
    "room": "ม.1/2"
  },
  "16294": {
    "code": "16294",
    "seatNo": 35,
    "name": "เด็กหญิงวริษฐา  โคกแปะ",
    "room": "ม.1/2"
  },
  "16298": {
    "code": "16298",
    "seatNo": 16,
    "name": "เด็กชายกฤษกร  อาจจงรักษ์",
    "room": "ม.1/4"
  },
  "16302": {
    "code": "16302",
    "seatNo": 34,
    "name": "เด็กหญิงพัชราภา  เชื้อทอง",
    "room": "ม.1/5"
  },
  "16310": {
    "code": "16310",
    "seatNo": 35,
    "name": "เด็กหญิงกชกร  ภูนบทอง",
    "room": "ม.1/5"
  },
  "16317": {
    "code": "16317",
    "seatNo": 17,
    "name": "เด็กชายธีระพัฒน์  จิรพัฒน์ไพลิน",
    "room": "ม.1/4"
  },
  "16318": {
    "code": "16318",
    "seatNo": 16,
    "name": "เด็กชายศุภวิทย์  ไชยพรม",
    "room": "ม.1/6"
  },
  "16319": {
    "code": "16319",
    "seatNo": 18,
    "name": "เด็กชายศิรสิทธิ์  วันน้อย",
    "room": "ม.1/4"
  },
  "16322": {
    "code": "16322",
    "seatNo": 17,
    "name": "เด็กชายสงกรานต์  สาลีมาตย์",
    "room": "ม.1/6"
  },
  "16326": {
    "code": "16326",
    "seatNo": 16,
    "name": "เด็กชายประจักษ์  โคตรโสภา",
    "room": "ม.1/2"
  }
};

export function getM1SgsStudentInfo(code: string): M1SgsLookupEntry | undefined {
  if (!code) return undefined;
  return M1_SGS_STUDENT_LOOKUP[code.trim()];
}

export function isGrade1SgsStudentCode(code: string): boolean {
  if (!code) return false;
  const clean = code.trim();
  if (M1_SGS_STUDENT_LOOKUP[clean]) return true;
  // SGS Grade 1 codes for this cohort: 15833, 16056-16326
  if (/^16\d{3}$/.test(clean)) return true;
  if (clean === '15833') return true;
  return false;
}
